requests/GetGeoIP.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://www.webservicex.net/">
    <soap:Header/>
    <soap:Body>
        <web:GetGeoIP>
            <!--Optional:-->
            <web:IPAddress>{IPAddress}</web:IPAddress>
        </web:GetGeoIP>
    </soap:Body>
</soap:Envelope>